---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.RevitServerException
source: html/1d9505e4-6f25-b9fc-c377-537b9fa1230b.htm
---
# RevitServerException Methods

Retrieves data needed to serialize the target object.